Autodesk.Revit.DB.PropertyLine.IsTableBased
Indicates if the PropertyLine element is table-based.
Returns:
True if the element is table-based, false if the element is sketch-based.
Since:
2027

Autodesk.Revit.DB.PropertyLine.IsValidToConvert
Check whether the sketch contains all valid supported curve type.
Returns:
True if the sketch only has line and arc, otherwise false.
Since:
2027

Autodesk.Revit.DB.PropertyLine.IsSketchBased
Indicates if the PropertyLine element is sketch-based.
Returns:
True if the element is sketch-based, false if the element is table-based.
Since:
2027

Autodesk.Revit.DB.PropertyLine.IsClosedLoop
Indicates whether the PropertyLine curves form a closed loop.
Returns:
True if the curves are a closed loop; false otherwise.
Since:
2027

Autodesk.Revit.DB.PropertyLine.ConvertToTable
Converts sketch based to table based
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
PropertyLine is sketch-based.
-or-
PropertyLine contains some unsupported curve type, only line and arc are supported to convert to table.
-or-
Failed to convert to table if it is already a sketch-based PropertyLine.
-or-
Failed to convert to table if the sketch contains some other curve types like spline and ellipse,
only line and arc are consider as valid curve type when convert to table.
-or-
Failed to convert if it is already table-based
Since:
2027

Autodesk.Revit.DB.PropertyLine.GetPropertyTable
Gets the table entries for a table-based PropertyLine element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
PropertyLine is not table-based.
-or-
Failed to get property table for the property line element if it is sketch-based.
Since:
2027

Autodesk.Revit.DB.PropertyLine.SetPropertyTable(System.Collections.Generic.IList{Autodesk.Revit.DB.PropertyTableEntry})
Sets the table entries for a table-based PropertyLine element.
newTable:
Input property table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
PropertyLine is not table-based.
-or-
Failed to set property table for the property line element if it is sketch-based.
Since:
2027

Autodesk.Revit.DB.PropertyLine.SetStart(Autodesk.Revit.DB.XYZ)
Sets the start of point of a table-based PropertyLine element.
start:
The new start point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
PropertyLine is not table-based.
-or-
Failed to set start for the property line element if it is sketch-based property line element.
Since:
2027

Autodesk.Revit.DB.PropertyLine.GetStart
Gets the start point of the PropertyLine element.
Returns:
The start point's coordinates.
Since:
2027

Autodesk.Revit.DB.PropertyLine.IsValidPropertyTable(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.PropertyTableEntry})
Function used to check the input table is valid to create property line element
document:
The document to check.
pt:
Input property table to valid.
Returns:
True if it is valid to create PropertyLine; otherwise it is not valid to create propertyline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.PropertyLine.IsValidBoundary(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Identifies whether the given curve loops compose a valid boundary to create PropertyLine element.
Remarks:
The curve loops is not necessary to close, it could be open, but should not intersect with each other;
and each loop is planar and lies on a plane parallel to the horizontal(XY) plane.
Also, the curves should not contain any unbounded circle/ellipse.
curveLoops:
The curve loops to be checked.
Returns:
True if the given curve loops don't intersect with each other;
and each loop is planar and lies on a plane parallel to the horizontal(XY) plane.
Any requirement above is not satisfied or no curve loops contained, returns false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.PropertyLine.SetBoundary(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Set a given curve loops as the boundary of the current PropertyLine element.
curveLoops:
A collection of curve loops to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
no curve loop is contained in the given collection;
these curve loops intersect with each other for some of them;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the Sketch for the boundary of current PropertyLine element.
Since:
2027

Autodesk.Revit.DB.PropertyLine.GetBoundary
Gets the boundary of current PropertyLine element.
Returns:
The curve loops that represent the boundary of the PropertyLine element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to get boundary of current PropertyLine element if it is not create by sketch.
Since:
2027

Autodesk.Revit.DB.PropertyLine.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.PropertyTableEntry})
Creates a new PropertyLine element from property table and adds it to the document.
Remarks:
If the input property table contains any entry that with very short distance.
an InvalidOperationException will be thrown.
document:
The document to be modified.
pt:
The input of the Property Table.
Returns:
The new PropertyLine element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Property table is invalid - it refers to either property table size is too less or distance is too short.
Another case is for arc type, if the radius value is smaller than half distance.
It will also be considered as invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the new PropertyLine with input property table.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2027

Autodesk.Revit.DB.PropertyLine.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a new Property element with input CurveLoops and adds it to the document.
Remarks:
If the input curve loops either:
1) Intersect/overlapped the curve loops within itself.
2) The curves are not in the same plane.
3) Curves include any unbounded circles/ellipses
an InvalidOperationException will be thrown.
Note that, the curveloop could be open, it is not required to be closed curve loops.
document:
The document to be modified.
curveLoops:
The boundary of the PropertyLine.
Returns:
The new PropertyLine element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
no curve loop is contained in the given collection;
these curve loops intersect with each other for some of them;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create new Property line element from input curveloops.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2027

Autodesk.Revit.DB.PropertyLine.SketchId
Get the sketch Id of the PropertyLine element if it is sketch-based. Otherwise it will return invalidElementId.
Since:
2027

Autodesk.Revit.DB.PropertyLine.Area
The area of the PropertyLine element, if it is close loop, the value would be greater than 0, otherwise it will return -1.
Since:
2027

Autodesk.Revit.DB.PropertyLine
Class represents for property line element
Since:
2027